In [64]:
import pandas as pd

In [65]:
df_ratings=pd.read_csv("../../ant-learn-pandas/datas/movielens-1m/ratings.dat", 
sep="::",
engine='python', 
names="UserID::MovieID::Rating::Timestamp".split("::"))
df_users = pd.read_csv("../../ant-learn-pandas/datas/movielens-1m/users.dat", 
sep="::",
engine='python', 
names="UserID::Gender::Age::Occupation::Zip-code".split("::"))

In [66]:
df_ratings_users = pd.merge(df_ratings, df_users, left_on="UserID", right_on="UserID", how="inner")
df_ratings_users.head()

   UserID  MovieID  Rating  Timestamp Gender  Age  Occupation Zip-code
0       1     1193       5  978300760      F    1          10    48067
1       1      661       3  978302109      F    1          10    48067
2       1      914       3  978301968      F    1          10    48067
3       1     3408       4  978300275      F    1          10    48067
4       1     2355       5  978824291      F    1          10    48067

In [67]:
left = pd.DataFrame({'sno': [11, 11, 13, 14],'aihao': ['a', 'b', 'c', 'd']})
right = pd.DataFrame({'sno': [11, 12, 13, 14, 14],'chengji': ['21', '99','19', '1', '0']})
left,right

(   sno aihao
 0   11     a
 1   11     b
 2   13     c
 3   14     d,
    sno chengji
 0   11      21
 1   12      99
 2   13      19
 3   14       1
 4   14       0)

In [68]:
pd.merge(left, right, on='sno')

   sno aihao chengji
0   11     a      21
1   11     b      21
2   13     c      19
3   14     d       1
4   14     d       0

In [69]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'A': ['00', '01', '02', '03'],
                      'B': ['10', '11', '12', '13']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K4', 'K5'],
                      'C': ['30', '31', '34', '35'],
                      'D': ['40', '41', '44', '45']})
left1= pd.DataFrame({'key':['K0', 'K1', 'K2', 'K5'],
                      'A': ['10', '10', '20', '50'],
                      'D': ['40', '41', '44', '45']})
left,right,left1

(  key   A   B
 0  K0  00  10
 1  K1  01  11
 2  K2  02  12
 3  K3  03  13,
   key   C   D
 0  K0  30  40
 1  K1  31  41
 2  K4  34  44
 3  K5  35  45,
   key   A   D
 0  K0  10  40
 1  K1  10  41
 2  K2  20  44
 3  K5  50  45)

In [70]:
pd.merge(left, right)

  key   A   B   C   D
0  K0  00  10  30  40
1  K1  01  11  31  41

In [71]:
pd.merge(left, right, how='outer')

  key    A    B    C    D
0  K0   00   10   30   40
1  K1   01   11   31   41
2  K2   02   12  NaN  NaN
3  K3   03   13  NaN  NaN
4  K4  NaN  NaN   34   44
5  K5  NaN  NaN   35   45

In [72]:
pd.merge(left, left1, on='key', suffixes=('_left', '_left1'))

  key A_left   B A_left1   D
0  K0     00  10      10  40
1  K1     01  11      10  41
2  K2     02  12      20  44